[
    {
        "id": "1",
        "title": "Визуальная новелла \"NITT\"",
        "description": "NITT - это новелла, сочетающая в себе сразу множество жанров: квест, хоррор, рпг и т.д.",
        "imageSrc": "/bchp/bcph_nitt.png",
        "skills": ["Английский язык", "Русский язык", "Python", "Графический дизайн", "RenPy"],
        "fullText": "В феврале 2024 года я начал разработку собственной визуальной новеллы на движке RenPy, и на языке программирования Python соответственно. Проект стал местом адаптации к самостоятельной работе. Код в RenPy играет малую роль, написание сценария работы программы обычно не требует особых знаний ни языка, ни движка, но это: дизайн, сценарное мастерство, саунд-дизайн, самостоятельность и серьезные намерения. Я еще, я как всегда, не хочу просто, тут вам инвентарь, улучшения и другие прелести программируемые. Намерен завершить проект, но не в срочном порядке. Трейлер и демо-версия ожидается к концу 2025 года. Следить - в моем Telegram-канале."
    },
    {
        "id": "2",
        "title": "Сайт-портфолио на чистом HTML, CCS, JS",
        "description": "Сайт разработчика - отражение его навыков.",
        "imageSrc": "/bchp/bcph_portfolio.png",
        "skills": ["HTML, CSS, JS", "Графический дизайн"],
        "fullText": "Добро пожаловать! Сейчас вы находитесь именно здесь. Этот сайт - отправная точка, следующий этап, начало нового раздела в IT для меня. Надеюсь вам нравится."
    },
    {
        "id": "3",
        "title": "Бот для текстовых новелл во ВКонтакте",
        "description": "Бот, позволявший параллельно проигрывать новеллы с сохранением прогресса, достижениями.",
        "imageSrc": "/bchp/bcph_caxapool.png",
        "skills": ["Python", "SQLite", "API"],
        "fullText": "Было время... Кажется, летом 2022-го года, начинается история вообще первого моего опыта программирования. С огромной помощью потрясающего человека, @eennou (VK), я разобрался с VK API и написал бота ВКонтакте, который позволял играть в заранее расписанные в базах данных истории с развилками. Использовал встроенную LiteSQL, писал на Python3 на стандартной библиотеке VKApi в смешении с ручными запросами."
    },
    {
        "id": "4",
        "title": "Тестирование в рамках программы VK Testers",
        "description": "Ручное тестирование продуктов ВКонтакте: веб-сайта, приложений, сервисов.",
        "imageSrc": "/bchp/bcph_vkt.png",
        "skills": ["Ручное тестирование", "API"],
        "fullText": "VK Testers — программа бета-тестирования «ВКонтакте»."
    }
]